cask_args appdir: '/Applications'

# -----------------------------------------------
# Install brew packages
# -----------------------------------------------

# Tap
tap 'caskroom/cask'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/homebrew-php'

# Some usefull packages
brew 'git'
brew 'node'
brew 'tree'
brew 'tmux'
brew 'php56'
brew 'drush'
brew 'imagemagick'
brew 'rbenv ruby-build'
brew 'youtube-dl'

# Shell
brew 'zsh'

# -----------------------------------------------
# Install software
# -----------------------------------------------

# Browsers
cask 'google-chrome'
cask 'firefox'
cask 'opera'

# Tools
cask 'dropbox'
cask 'harvest'
cask 'atom'
cask 'sublime-text'
cask 'iterm2'
cask 'cleanmymac'
cask 'appcleaner'
cask 'imageoptim'
cask 'rescuetime'
cask 'the-unarchiver'
cask 'diffmerge'

# Design
cask 'sketch'
cask 'sketch-toolbox'
cask 'adobe-creative-cloud'
cask 'rightfont'

# IM
cask 'slack'
cask 'skype'

# For VMs
cask 'parallels-desktop'

# Freetime
cask 'garmin-express'

# App store apps
# cask '1password'
# cask 'transmit'
