cask_args appdir: '/Applications'

# -----------------------------------------------
# Install brew packages
# -----------------------------------------------

# Tap
tap 'caskroom/cask'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/services'
tap 'homebrew/homebrew-php'

# Some usefull packages
brew 'git'
brew 'node'
brew 'tree'
brew 'php56'
brew 'drush'
brew 'imagemagick'
brew 'wget'
brew 'rbenv ruby-build'
brew 'postgresql'
brew 'youtube-dl'
brew 'vim --override-system-vi'
brew 'openssl'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'watchman'
brew 'httpie'
brew 'utf8proc'
brew 'shellcheck'
# brew 'tmate'


# Shell
brew 'zsh'
brew 'michaeldfallen/formula/git-radar'

# -----------------------------------------------
# Install software
# -----------------------------------------------

# Browsers
cask 'google-chrome'
cask 'firefox'
cask 'opera'

# Tools
cask 'dropbox'
cask 'harvest'
cask 'atom'
cask 'sublime-text'
cask 'iterm2-beta'
cask 'cleanmymac'
cask 'appcleaner'
cask 'imageoptim'
cask 'rescuetime'
cask 'the-unarchiver'
cask 'diffmerge'
# cask 'flux'

# Design
cask 'sketch'
cask 'adobe-creative-cloud'
cask 'rightfont'

# IM
cask 'slack'
cask 'skype'

# Freetime
cask 'garmin-express'

# App store apps
# cask '1password'
# cask 'transmit'
